Repository: pennisiandrea/pickup-station
Catalog: PickupStation/Logical/Source/Picker/PickerAlarms.tmx
Source language: en
Languages: it

source: Picker was not able to reach forward position
it: Picker non è stato in grado di raggiungere la posizione avanti

source: Picker was not able to reach backward position
it: Picker non è stato in grado di raggiungere la posizione indietro

source: Picker was not able to pick the cap
it: Picker non è stato in grado di creare il vuoto

source: Picker was not able to place the cap
it: Picker non è stato in grado di rimuovere il vuoto

source: Picker forward/backward sensors simultaneously active
it: Picker ha rilevato una combinazione anomala dei sonsori avanti/indietro
